<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"fad1c31bbdec9901bde41834c9eef77cdadc64a9412eacc535fdd9fb08608b68","plan_job_ref":"Job Staging Image Build & Push #9 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343499067","plan_hash":"e259bcdd438d9f5d08d58330f1bf223266a9d53a94791f7e18b12d20a593a797","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 5 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:9" -> "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:10"
#        (16 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "dev_FastAPI_image" -> null
-           container_port   = 5000 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group/7c49f2922395a2e5" -> null
        }
+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = (known after apply)
        }

!~      network_configuration {
!~          security_groups  = [
-               "sg-047016b150e4e9568",
            ] -> (known after apply)
#            (2 unchanged attributes hidden)
        }

#        (2 unchanged blocks hidden)
    }

  # aws_lb.alb will be created
+   resource "aws_lb" "alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "fastapi-lb-dev"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (sensitive value)
+       tags_all                                                     = {
+           "Environment" = "Dev Environment"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.target_group_P-5000 will be created
+   resource "aws_lb_target_group" "target_group_P-5000" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "alb-target-group-dev"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "ip"
+       vpc_id                             = "*********************"
    }

  # aws_security_group.ALB_to_containers must be replaced
-/+ resource "aws_security_group" "ALB_to_containers" {
!~      arn                    = "arn:aws:ec2:eu-central-1:806066816337:security-group/sg-047016b150e4e9568" -> (known after apply)
!~      id                     = "********************" -> (known after apply)
!~      ingress                = [
-           {
-               cidr_blocks      = []
-               description      = "Inbound ALB to ECS containers"
-               from_port        = 5000
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = [
-                   "sg-09895e6a8deaf278b",
                ]
-               self             = false
-               to_port          = 5000
            },
+           {
+               cidr_blocks      = []
+               description      = "Inbound ALB to ECS containers"
+               from_port        = 5000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 5000
            },
        ]
!~      name                   = "alb-to-containers" -> "alb-to-containers-dev" # forces replacement
+       name_prefix            = (known after apply)
!~      owner_id               = "************" -> (known after apply)
-       tags                   = {} -> null
!~      vpc_id                 = "*********************" -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # aws_security_group.internet_to_ALB must be replaced
-/+ resource "aws_security_group" "internet_to_ALB" {
!~      arn                    = "arn:aws:ec2:eu-central-1:806066816337:security-group/sg-09895e6a8deaf278b" -> (known after apply)
!~      id                     = "********************" -> (known after apply)
!~      name                   = "internet-to-alb" -> "internet-to-alb-dev" # forces replacement
+       name_prefix            = (known after apply)
!~      owner_id               = "************" -> (known after apply)
-       tags                   = {} -> null
!~      vpc_id                 = "*********************" -> (known after apply)
#        (5 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #9](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7343499067)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>